content/teaching.org
#+title: Teaching
#+author: Patrick D. Elliott

* HHU Winter Semeser 2022-23

** Going plural: compositional routes to multiplicity in natural language

- Advanced semantics seminar.
- [[https://github.com/patrl/hhu-multiplicity]]
  
** Continuations and friends: what linguists can learn from programming language theorists

- Advanced semantics seminar.
- [[https://github.com/patrl/hhu-fp]]
  
* Past teaching

** MIT

- /Topics in semantics/
  * Grad research seminar on anaphora
  * Spring 2022
- /Introduction to semantics/
  * Grad seminar
  * With Martin Hackl
  * Fall 2021
- /Language and its structure III: semantics/
  * Undergrad seminar
  * Spring 2021
- /Topics in semantics/
  * Grad research seminar on questions
  * Spring 2021
- /Pragmatics in linguistic theory/
  * Grad seminar
  * with Danny Fox
  * Fall 2020
- /Topics in semantics/
  * Grad research seminar on scope and projective content
  * with Martin Hackl
  * Spring 2020
- /Pragmatics in linguistic theory/
  * Grad seminar
  * with Roger Schwarzschild
  * Fall 2019
- /Language and its structure II: syntax/
  * Undergrad seminar
  * Fall 2019
    
** Other

- EGG summer school, Banja Luka
  * Summer 2018
  * Primary instructor for "Topics in the syntax of ellipsis" (with Andrew Murphy), "Ellipsis, binding, and Logical Form" (with Yasu Sudo), and "Introduction to semantics" (with Gillian Ramchand).
- ACTL summer school, UCL, London
  * Summer 2018
  * Primary instructor for "Introduction to dynamic semantics".
