teaching.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-03 Sat 17:45 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Teaching</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/patrickdelliott.css" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.15.1/dist/katex.min.css" integrity="sha384-R4558gYOUz8mP9YWpZJjofhk+zx0AS11p36HnD2ZKj/6JR5z27gSSULCNHIRReVs" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<nav id="preamble" class="status">
<a class="active" href="/">Home</a>
<a href="/research/papers.html">Papers</a>
<a href="/research/slides-handouts.html">Talks</a>
<a href="/teaching.html">Teaching</a>
<a href="/resources.html">Resources</a>
<!-- <a href="https://blog.patrickdelliott.com">Blog</a> -->
<!-- <a href="https://notes.patrickdelliott.com">Notes</a> -->
</nav>
<main id="content" class="content">
<header>
<h1 class="title">Teaching</h1>
</header>
<section id="outline-container-orgc1b8c84" class="outline-2">
<h2 id="orgc1b8c84">HHU Winter Semeser 2022-23</h2>
<div class="outline-text-2" id="text-orgc1b8c84">
</div>
<div id="outline-container-org4bc447d" class="outline-3">
<h3 id="org4bc447d">Going plural: compositional routes to multiplicity in natural language</h3>
<div class="outline-text-3" id="text-org4bc447d">
<ul class="org-ul">
<li>Advanced semantics seminar.</li>
<li><a href="https://github.com/patrl/hhu-multiplicity">https://github.com/patrl/hhu-multiplicity</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc4a4a85" class="outline-3">
<h3 id="orgc4a4a85">Continuations and friends: what linguists can learn from programming language theorists</h3>
<div class="outline-text-3" id="text-orgc4a4a85">
<ul class="org-ul">
<li>Advanced semantics seminar.</li>
<li><a href="https://github.com/patrl/hhu-fp">https://github.com/patrl/hhu-fp</a></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org24f6271" class="outline-2">
<h2 id="org24f6271">Past teaching</h2>
<div class="outline-text-2" id="text-org24f6271">
</div>
<div id="outline-container-orgfcf40f4" class="outline-3">
<h3 id="orgfcf40f4">MIT</h3>
<div class="outline-text-3" id="text-orgfcf40f4">
<ul class="org-ul">
<li><i>Topics in semantics</i>
<ul class="org-ul">
<li>Grad research seminar on anaphora</li>
<li>Spring 2022</li>
</ul></li>
<li><i>Introduction to semantics</i>
<ul class="org-ul">
<li>Grad seminar</li>
<li>With Martin Hackl</li>
<li>Fall 2021</li>
</ul></li>
<li><i>Language and its structure III: semantics</i>
<ul class="org-ul">
<li>Undergrad seminar</li>
<li>Spring 2021</li>
</ul></li>
<li><i>Topics in semantics</i>
<ul class="org-ul">
<li>Grad research seminar on questions</li>
<li>Spring 2021</li>
</ul></li>
<li><i>Pragmatics in linguistic theory</i>
<ul class="org-ul">
<li>Grad seminar</li>
<li>with Danny Fox</li>
<li>Fall 2020</li>
</ul></li>
<li><i>Topics in semantics</i>
<ul class="org-ul">
<li>Grad research seminar on scope and projective content</li>
<li>with Martin Hackl</li>
<li>Spring 2020</li>
</ul></li>
<li><i>Pragmatics in linguistic theory</i>
<ul class="org-ul">
<li>Grad seminar</li>
<li>with Roger Schwarzschild</li>
<li>Fall 2019</li>
</ul></li>
<li><i>Language and its structure II: syntax</i>
<ul class="org-ul">
<li>Undergrad seminar</li>
<li>Fall 2019</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8a30699" class="outline-3">
<h3 id="org8a30699">Other</h3>
<div class="outline-text-3" id="text-org8a30699">
<ul class="org-ul">
<li>EGG summer school, Banja Luka
<ul class="org-ul">
<li>Summer 2018</li>
<li>Primary instructor for "Topics in the syntax of ellipsis" (with Andrew Murphy), "Ellipsis, binding, and Logical Form" (with Yasu Sudo), and "Introduction to semantics" (with Gillian Ramchand).</li>
</ul></li>
<li>ACTL summer school, UCL, London
<ul class="org-ul">
<li>Summer 2018</li>
<li>Primary instructor for "Introduction to dynamic semantics".</li>
</ul></li>
</ul>
</div>
</div>
</section>
</main>
</body>
</html>
